## Выравнивание при наследовании

В этом уроке вы узнаете, как устроены внутри объекты классов при наследовании. Посмотрите на пример:

```cpp
struct Base1 {
    int i;
    char c;
};

struct Base2 {
    bool b;
    float f;
};

struct Outer : Base1, Base2 {
    short sh;
};

int main() {
    cout << sizeof(Outer) << " "s 
         << sizeof(Base1) << " "s 
         << sizeof(Base2) << endl;
}
```
Программа напечатает:
```
20 8 8 
```
Размер структуры `Outer` достаточно большой. Значит, объект неявно содержит всю нужную информацию о наследуемых полях.

Макрос `offsetof` невозможно применить к полям базового класса. В таких случаях приходится применять тяжелую артиллерию.

Используем компилятор clang и специальные флаги компиляции, позволяющие увидеть, как устроены структуры внутри кода:
```
clang -Xclang -fdump-record-layouts plate.cpp 
```
Запустив компиляцию с этим флагом, увидите тонны информации. Она нужна не вся. Можно просто автоматическим поиском по тексту найти слово Outer:
```cpp
*** Dumping AST Record Layout
         0 | struct Outer
         0 |   struct Base1 (base)
         0 |     int i
         4 |     char c
         8 |   struct Base2 (base)
         8 |     _Bool b
        12 |     float f
        16 |   short sh
           | [sizeof=20, align=4,
           |  nvsize=20, nvalign=4] 
```
Всё об `Outer` — как на ладони. Видно, что эта структура содержит базовые структуры `Base1` и `Base2`. В целом, нет разницы со случаем, когда структура `Outer` просто имеет поля типов `Base1` и `Base2`.
Что выведет программа в результате работы?
```cpp
struct Base1 {
    int i;
    char c;
};

struct Base2 : Base1 {
    bool b;
    float f;
};

struct Outer : Base2 {
    short sh;
};

int main() {
    cout << sizeof(Outer) << " "s 
         << sizeof(Base1) << " "s 
         << sizeof(Base2) << endl;
} 
```
> 20 8 16

Размер структуры `Outer` не изменился, так как она всё так же включает в себя обе структуры Base1 и `Base2`. 

После компиляции с флагом `fdump-record-layouts` увидим следующую картину:

```cpp
*** Dumping AST Record Layout 
         0 | struct Base1 
         0 |   int i 
         4 |   char c 
           | [sizeof=8, dsize=8, align=4, 
           |  nvsize=8, nvalign=4] 
 
*** Dumping AST Record Layout 
         0 | struct Base2 
         0 |   struct Base1 (base) 
         0 |     int i 
         4 |     char c 
         8 |   _Bool b 
        12 |   float f 
           | [sizeof=16, dsize=16, align=4, 
           |  nvsize=16, nvalign=4] 
 
*** Dumping AST Record Layout 
         0 | struct Outer 
         0 |   struct Base2 (base) 
         0 |     struct Base1 (base) 
         0 |       int i 
         4 |       char c 
         8 |     _Bool b 
        12 |     float f 
        16 |   short sh 
           | [sizeof=20, dsize=18, align=4, 
           |  nvsize=18, nvalign=4]
```