## Ловкость рук и никакого волшебства
В прошлом уроке мы обнаружили у волшебной шляпы секретный отсек, размер которого всегда равен 8 байтам. 
Какой тип данных может скрываться за этими 8 байтами?

- `double`
- `int64_t`
- `void*` в 32-разрядной архитектуре
- `int*` в 64-разрядной архитектуре
- `void*` в 64-разрядной архитектуре


Размер указателя зависит от разрядности и не зависит от типа данных. Чтобы понять это, вспомните, что указатель хранит в себе адрес в памяти. То есть указатель должен быть такого размера, чтобы любой возможный адрес памяти мог быть сохранён в нём. Если архитектура процессора 32-разрядная, то адрес представляет собой 32 бита. Размер указателя должен быть не меньше, но и не больше такого числа.

Остаётся слишком много предположений, что же это за 8 байт. Используем уже известные вам флаги компиляции и рассмотрим волшебную шляпу и наследующие от неё классы более детально:
```
*** Dumping AST Record Layout
         0 | class MagicHat
         0 |   (MagicHat vftable pointer)
           | [sizeof=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class HatWithApples
         0 |   class MagicHat (primary base)
         0 |     (MagicHat vftable pointer)
           | [sizeof=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class HatWithRabbits
         0 |   class MagicHat (primary base)
         0 |     (MagicHat vftable pointer)
           | [sizeof=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class HatWithDoves
         0 |   class MagicHat (primary base)
         0 |     (MagicHat vftable pointer)
           | [sizeof=8, align=8,
           |  nvsize=8, nvalign=8] 
```
В предыдущей теме вы узнали, что при наследовании объект производного класса содержит в себе объект базового класса. У шляпы с яблоками, шляпы с кроликами и шляпы с голубями внутри есть волшебная шляпа. Вся магия именно в ней. В волшебной шляпе есть некий указатель на `vftable`. Именно он занимает 8 байт. Другие имена указателя: vptr, vtable pointer или vtable. По-русски его называют указатель на виртуальную таблицу или указатель на таблицу виртуальных функций.

На схеме видно, что он содержится в объекте класса `MagicHat`, а значит он же будет во всех объектах классов, наследующих от волшебной шляпы.

В следующем уроке вы узнаете, на что именно указывает vptr и как всего 8 байт реализуют всю магию полиморфизма.