#include <iostream>
#include <vector>

using namespace std;

double Average(const vector<int>& xs) {
    // Напишите реализацию функции.
}

int main() {
    cout << Average({}) << endl;        // Результат: 0.
    cout << Average({2, 3}) << endl;    // Результат: 2.5.
    cout << Average({7, 2, 6}) << endl; // Результат: 5.
}